# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [5]:
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

In [22]:
import pandas as pd

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [10]:
c.execute('''SELECT *
            FROM SQLITE_MASTER''').fetchall()

[('table',
  'orderdetails',
  'orderdetails',
  2,
  'CREATE TABLE `orderdetails` (`orderNumber`, `productCode`, `quantityOrdered`, `priceEach`, `orderLineNumber`)'),
 ('table',
  'payments',
  'payments',
  28,
  'CREATE TABLE `payments` (`customerNumber`, `checkNumber`, `paymentDate`, `amount`)'),
 ('table',
  'offices',
  'offices',
  32,
  'CREATE TABLE `offices` (`officeCode`, `city`, `phone`, `addressLine1`, `addressLine2`, `state`, `country`, `postalCode`, `territory`)'),
 ('table',
  'customers',
  'customers',
  33,
  'CREATE TABLE `customers` (`customerNumber`, `customerName`, `contactLastName`, `contactFirstName`, `phone`, `addressLine1`, `addressLine2`, `city`, `state`, `postalCode`, `country`, `salesRepEmployeeNumber`, `creditLimit`)'),
 ('table',
  'orders',
  'orders',
  38,
  'CREATE TABLE `orders` (`orderNumber`, `orderDate`, `requiredDate`, `shippedDate`, `status`, `comments`, `customerNumber`)'),
 ('table',
  'productlines',
  'productlines',
  46,
  'CREATE TABLE `productlines` (`productLine`, `textDescription`, `htmlDescription`, `image`)'),
 ('table',
  'products',
  'products',
  47,
  'CREATE TABLE `products` (`productCode`, `productName`, `productLine`, `productScale`, `productVendor`, `productDescription`, `quantityInStock`, `buyPrice`, `MSRP`)'),
 ('table',
  'employees',
  'employees',
  56,
  'CREATE TABLE `employees` (`employeeNumber`, `lastName`, `firstName`, `extension`, `email`, `officeCode`, `reportsTo`, `jobTitle`)')]

In [25]:
c.execute('''SELECT lastName, firstName
            FROM employees
            JOIN customers
            ON employees.employeeNumber = customers.salesRepEmployeeNumber
            WHERE city = 'Boston' ''').fetchall()

[('Patterson', 'Steve'), ('Firrelli', 'Julie')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [28]:
c.execute('''SELECT city,
            COUNT(*)
            FROM offices
            LEFT JOIN employees
            USING(officeCode)
            GROUP BY 1;''')
df = pd.DataFrame(c.fetchall())
df.head()

# c.execute("""select city,
#                     count(*)
#                     from offices
#                     left join employees
#                     using(officeCode)
#                     group by 1;""")
# df = pd.DataFrame(c.fetchall())
# df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

In [ ]:
Which customer was most recently shipped something?

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!